{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "77f96c67",
   "metadata": {},
   "source": [
    "задание 1.\n",
    "Дано число. Проверьте, отрицательное оно или нет. Выведите об этом информацию в консоль."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "3363f16f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "вашие число: -5\n",
      "отрицательное\n"
     ]
    }
   ],
   "source": [
    "a=int(input('vvedite chislo'))\n",
    "if a>0:\n",
    "    print('вашие число:',a)\n",
    "    print('положительное')\n",
    "elif a<0:\n",
    "    print('вашие число:',a)\n",
    "    print('отрицательное')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5a9cc6c7",
   "metadata": {},
   "source": [
    "задание 2.\n",
    "Даны списки:\n",
    "a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];\n",
    "\n",
    "b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].\n",
    "Нужно вернуть список, который состоит из элементов, общих для этих двух списков."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "fccbacab",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[1, 1, 2, 3, 5, 8, 13]\n"
     ]
    }
   ],
   "source": [
    "a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]\n",
    "b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]\n",
    "result=list(filter(lambda elem:elem in b,a))\n",
    "print(result)\n",
    "\n",
    "#lambda elem: elem in b,a - принимает аргументы из массива для проверки на наличие в другом массиве\n",
    "#filter() - применяет оператора внутри, если элемент true,то включается в конечный результат если false не включается \n",
    "#elem-параметр функции(числа в массивах)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dd82b737",
   "metadata": {},
   "source": [
    "задание 3.\n",
    "\n",
    "Для заданного целого числа x верните true, если x является палиндромом, и false в противном случае.\n",
    "\n",
    "Пример:\n",
    "Входные данные: x = 121\n",
    "Выходные данные: true\n",
    "Пояснение: 121 читается как 121 слева направо и справа налево.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "3f201b9f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[1, 2, 3]\n",
      "ваше число:\n",
      "123\n",
      "число не является палиндромом\n"
     ]
    }
   ],
   "source": [
    "a=str(input('введите число'))\n",
    "digit=[int(digit) for digit in str(a)]\n",
    "print(digit)\n",
    "if a[0]!=a[-1]:\n",
    "    print('ваше число:')\n",
    "    print(a)\n",
    "    print('число не является палиндромом')\n",
    "if a[0]==a[-1]:\n",
    "    print('ваше число:')\n",
    "    print(a)\n",
    "    print('число является палиндромом')\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "057eafe9",
   "metadata": {},
   "source": [
    "задание 4.\n",
    "\n",
    "Семь различных символов обозначают римские цифры со следующими значениями:\n",
    "Символ\tЗначение\n",
    "I\t1\n",
    "V\t5\n",
    "X\t10\n",
    "L\t50\n",
    "C\t100\n",
    "D\t500\n",
    "M\t1000\n",
    "Римские цифры образуются путём добавления значений разрядов десятичной системы счисления в порядке убывания. При преобразовании значения разряда десятичной системы счисления в римскую цифру действуют следующие правила:\n",
    "\n",
    "Если значение не начинается с 4 или 9, выберите символ максимального значения, которое можно вычесть из исходного, добавьте этот символ к результату, вычтите его значение и преобразуйте остаток в римскую цифру.\n",
    "Если число начинается с 4 или 9, используйте вычитаемую форму, которая представляет собой один символ, вычитаемый из следующего символа. Например, 4 — это 1 (I) меньше 5 (V): IV и 9 — это 1 (I) меньше 10 (X): IX. Используются только следующие вычитаемые формы: 4 (IV), 9 (IX), 40 (XL), 90 (XC), 400 (CD) и 900 (CM).\n",
    "Только степени 10 (I, X, C, M) могут добавляться последовательно не более 3 раз для представления чисел, кратных 10. Вы не можете добавить 5 (V), 50 (L) или 500 (D) несколько раз. Если вам нужно добавить символ 4 раза, используйте форму вычитания.\n",
    "Данное целое число преобразуйте в римскую цифру.\n",
    "\n",
    " \n",
    "\n",
    "Пример 1:\n",
    "Ввод: num = 3749\n",
    "\n",
    "Вывод: \"MMMDCCXLIX\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "51f216c5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "M: 5\n",
      "D: 1\n",
      "A: 1\n",
      "\n",
      "X: 2\n",
      "I: 4.0\n",
      "4.0\n"
     ]
    }
   ],
   "source": [
    "import math as m\n",
    "\n",
    "\n",
    "u=int(input('введите число'))\n",
    "if M:=int(u/1000):\n",
    "   print('M:',M)\n",
    "if M<=0:\n",
    "    print()\n",
    "if D:=int((u%1000)/500):\n",
    "    print('D:',D)\n",
    "if D<=0:\n",
    "    print()\n",
    "if A:=int(((u%1000)%500)/100):\n",
    "    print('A:',A)\n",
    "if A<0:\n",
    "    print()\n",
    "if L:=int((((u%1000)%500)%100)/50):\n",
    "    print('L:',L)\n",
    "if L<=0:\n",
    "    print()\n",
    "if X:=int(((((u%1000)%500)%100)%50)/10):\n",
    "    print('X:',X)\n",
    "if X<=0:\n",
    "    print()\n",
    "if I:=int(((((u%1000)%500)%100)%50)%10)/1:\n",
    "    print('I:',I)\n",
    "if I<=0:\n",
    "    print()\n",
    "if M<=0 or D<=0 or A<=0 or L<=0 or X<=0 or I<=0:\n",
    "    print(I)\n",
    "    #print(M*m,D*d,A*a,L*l,X*x,I*i):"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "80afe69c",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1307e6db",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
